nc: 1
kpt_shape: [16, 3]  # 총 16개의 관절(keypoints), 각 관절당 (x, y, confidence) → 3차원
depth_multiple: 0.4
width_multiple: 0.4

backbone:
  # 원래 구조 유지
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9

head:
  # 원래구조 유지하고 마지막 부분만 수정
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]         # cat backbone P4
  - [-1, 3, C2f, [512]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]         # cat backbone P3
  - [-1, 3, C2f, [256]]               # P3/8 (small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]        # cat head P4
  - [-1, 3, C2f, [512]]               # P4/16 (medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]         # cat head P5
  - [-1, 3, C2f, [1024]]              # P5/32 (large)

  - [[15, 18, 21], 1, Pose, [nc, kpt_shape]]  # Pose output from P3, P4, P5
